[
	{
		"id":"2",
		"title":"DIY Website",
		"post":"<p>Building a personal website is somewhat of a rite of passage for software engineers who decide to undertake the task. It can be a fairly complicated application that can be scrutinized by anyone and everyone. Because of this, it is a good testament to the developers design experience and their knowledeg of existing libraries.</p><p>Much like a a painter and their paintings, an application created by a developer carries their unique style. In this respect a website is a good way to look at a developers technique, because unlike art, there are a few objective ways to measure an application. First off, you can asses the design of the application, have they seperated out functionality into seperate pieces that perform single functions, and does that seperation make sense, or is there a single piece that somehow manages to do everything itself? Each of these tells you a little bit more about the developer who wrote the application. In general, developers who've worked with large applications will tend to have better design than those who haven't. This usually means that they seperate their code into logical units that perform a series of similar functions, although it could also mean that they understand the difference between development and production ( when your application is in the wild ), and they've compressed it down to size.</p><p>Personal websites are a project that most developers will undertake alone, and therefore they have monopoly on the choices about which libraries they want to write with. This is equivalent to telling a child: 'using any tool you understand, build something cool'. This allows software developers to pick fancy libraries to show that they understand how to use them. Because of the initial caveat, 'using any tool you <i>understand</i>', the website will give you an idea of which technologies the devoloper understands and is comfortable using ( this caveat can also lead to developers never finishing their website, just because they find so many new interesting libraries to learn ).</p><p>At the end of the day, building a personal website can be a difficult challenge for a software developer depending on their level of expertise and knowledeg of existing libraries. This shouldn't discourage any developer who wants a personal website, because the website is a good showcase of the technique and knowledge base with which the software developer is currently approaching the problems they encounter.</p>"
	},
	{
		"id":"1",
		"title":"Test post",
		"post":"The post that exists to pad the post list until there are more posts."
	}

]